OpenFOAM-3.0.0/cases/3d-monopole/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*
| =========                 |                                                 |
| //      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  //    /   O peration     | Version:  2.4.0                                 |
|   //  /    A nd           | Web:      www.OpenFOAM.org                      |
|    ///     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters  1;

vertices
(
    ( 0.075 0 0)		//0
    ( 0.1 0 0)		//1
    (1 0 0)		//2

    (0  0.075 0)		//3
    (0  0.1 0)		//4
    (0 1 0 )		//5

    (-0.075 0 0)	//6
    (-0.1 0 0)		//7
    (-1 0 0)		//8

    (0 -0.075 0)	//9
    (0 -0.1 0)		//10
    (0 -1 0 )		//11

    ( 0.075 0 1)		//12
    ( 0.1 0 1)		//13
    (1 0 1)		//14

    (0  0.075 1)		//15
    (0  0.1 1)		//16
    (0 1 1 )		//17

    (-0.075 0 1)	//18
    (-0.1 0 1)		//19
    (-1 0 1)		//20

    (0 -0.075 1)	//21
    (0 -0.1 1)		//22
    (0 -1 1)		//23
);

blocks
(
    hex (0 3 6 9 12 15 18 21) (15 15 50) simpleGrading (1 1 20)
    
    hex (0 1 4 3 12 13 16 15) (10 15 50) simpleGrading (0.1 1 20)
    hex (3 4 7 6 15 16 19 18) (10 15 50) simpleGrading (0.1 1 20)
    hex (6 7 10 9 18 19 22 21) (10 15 50) simpleGrading (0.1 1 20)
    hex (9 10 1 0 21 22 13 12) (10 15 50) simpleGrading (0.1 1 20)

    hex (1 2 5 4 13 14 17 16) (50 15 50) simpleGrading (100 1 20)
    hex (4 5 8 7 16 17 20 19) (50 15 50) simpleGrading (100 1 20)
    hex (7 8 11 10 19 20 23 22) (50 15 50) simpleGrading (100 1 20)
    hex (10 11 2 1 22 23 14 13) (50 15 50) simpleGrading (100 1 20)

);

edges
(
	arc 1 4 (0.0707106781 0.0707106781 0)
	arc 4 7 (-0.0707106781 0.0707106781 0)
	arc 7 10 (-0.0707106781 -0.0707106781 0)
	arc 10 1 (0.0707106781 -0.0707106781 0)

	arc 2 5 (0.707106781 0.707106781 0)
	arc 5 8 (-0.707106781 0.707106781 0)
	arc 8 11 (-0.707106781 -0.707106781 0)
	arc 11 2 (0.707106781 -0.707106781 0)

	arc 13 16 (0.0707106781 0.0707106781 1)
	arc 16 19 (-0.0707106781 0.0707106781 1)
	arc 19 22 (-0.0707106781 -0.0707106781 1)
	arc 22 13 (0.0707106781 -0.0707106781 1)

	arc 14 17 (0.707106781 0.707106781 1)
	arc 17 20 (-0.707106781 0.707106781 1)
	arc 20 23 (-0.707106781 -0.707106781 1)
	arc 23 14 (0.707106781 -0.707106781 1)
);

boundary
(
    piston
    {
        type wall;
        faces
        (
            (0 3 6 9)
		(0 1 4 3)
		(3 4 7 6)
		(6 7 10 9)
		(9 10 1 0)
        );
    }
    baffle
    {
        type wall;
        faces
        (
		(1 2 5 4)
		(4 5 8 7)
		(7 8 11 10)
		(10 11 2 1)
        );
    }
    open
    {
        type patch;
        faces
        (
            (2 14 17 5)
            (5 17 20 8)
            (8 20 23 11)
            (11 23 14 2)

            (12 15 18 21)
		(12 13 16 15)
		(15 16 19 18)
		(18 19 22 21)
		(21 22 13 12)

		(13 14 17 16)
		(16 17 20 19)
		(19 20 23 22)
		(22 23 14 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
